Revit 2024 API
CurveByPoints.SetVisibility Method
Sets the visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetVisibility(
	FamilyElementVisibility visibility
)
Visual Basic
Public Sub SetVisibility ( _
	visibility As FamilyElementVisibility _
)
Visual C++
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
Parameters
visibility
Type: Autodesk.Revit.DB.FamilyElementVisibility
Remarks
The visibility of the CurveByPoints can be changed for different types of views and detail levels in the project.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when visibility is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when regeneration failed.
See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace